trainback/backend/module/practice/controllers/MessageController.php

	public function actionGetdesign(){
		//获取教学设计数据
		$request = \Yii::$app->request;
		$username=$request ->post('username');
		$type=$request ->post('type');
		$kind=$request ->post('kind');
		$status=$request ->post('status');
		$query=(new Query())
		      ->select('*')
		      ->from('student_files')
		      ->andWhere(['username'=>$username])
		      ->andWhere(['type'=>$type])
		      ->andWhere(['kind'=>$kind])
		      ->andWhere(['status'=>$status])
		      ->all();
---
SELECT * FROM `student_files` WHERE (`username`='chengqi') AND (`type`=2) AND (`kind`=7) AND (`status`=1)