trainback/backend/module/probation/controllers/ArrangeController.php

	public function actionGetarr(){
		//返回地点分配数据(见习)
		$request = \Yii::$app->request;
		$currentpage=$request ->post('page');
		$pageSize=8;
		$query=(new Query())
		      ->select('*')
		      ->from('site_arrange')
		      ->andWhere(['typeId'=>1])
		      ->andWhere(['status'=>1])
		      ->all();
		$query1=(new Query())
		      ->select('*')
		      ->from('site_arrange')
		      ->andWhere(['typeId'=>1])
		      ->andWhere(['status'=>1]);
		 $querycount=clone $query1;
		 $totalCount=$querycount->count();
		 $data=$query1->offset($pageSize*($currentpage-1))->limit($pageSize)->all();
---
SELECT * FROM `site_arrange` WHERE (`typeId`=1) AND (`status`=1)
SELECT COUNT(*) FROM `site_arrange` WHERE (`typeId`=1) AND (`status`=1)
SELECT * FROM `site_arrange` WHERE (`typeId`=1) AND (`status`=1) LIMIT 8