trainback/backend/module/probation/controllers/InfomationController.php

	public function actionGetarrange(){
		//获取见习导师分配的所有信息
		$request = \Yii::$app->request;
		$currentpage=$request ->post('page');
		$pageSize=8;
		$query=(new Query())
		      ->select('*')
		      ->from('arrange_info')
		      ->andWhere(['status'=>1])
		      ->andWhere(['type'=>1])
		      ->all();
		$query1=(new Query())
		      ->select('*')
		      ->from('arrange_info')
		      ->andWhere(['status'=>1])
		      ->andWhere(['type'=>1]);
		 $querycount=clone $query1;
		 $totalCount=$querycount->count();
		 $data=$query1->offset($pageSize*($currentpage-1))->limit($pageSize)->all();
---
SELECT * FROM `arrange_info` WHERE (`status`=1) AND (`type`=1)
SELECT COUNT(*) FROM `arrange_info` WHERE (`status`=1) AND (`type`=1)
SELECT * FROM `arrange_info` WHERE (`status`=1) AND (`type`=1) LIMIT 8

	public function actionGetfile(){
		//获取见习文件数据
		$request = \Yii::$app->request;
		$username=$request->post('username');
		$type=$request->post('type');
		$result=(new Query())
		       ->select('*')
		       ->from('probation_files')
		       ->andWhere(['username'=>$username])
		       ->andWhere(['type'=>$type])
		       ->andWhere(['status'=>1])
		       ->all();
---
SELECT * FROM `probation_files` WHERE (`username`='chengqi') AND (`type`=1) AND (`status`=1)

	public function actionDelmyvideo(){
		$request = \Yii::$app->request;
		$id=$request->post('id');
		$delete=Yii::$app->db->createCommand()->update('probation_videos',
        	[
        	'status'=>0
        	],
        	'vId=:id',[':id' => $id])->execute();
---
UPDATE `probation_videos` SET `status`=0 WHERE vId='1'

	public function actionFileurl(){
		//获取文件路径
		$request = \Yii::$app->request;
        $id=$request->post('id');
        $query=(new Query())
          ->select('*')
          ->from('probation_files')
          ->andWhere(['fId'=>$id])
          ->andWhere(['status'=>1])
          ->one();
---
SELECT * FROM `probation_files` WHERE (`fId`='2') AND (`status`=1)

	public function actionVideourl(){
		//获取视频路径
		$request = \Yii::$app->request;
        $id=$request->post('id');
        $query=(new Query())
          ->select('*')
          ->from('probation_videos')
          ->andWhere(['vId'=>$id])
          ->andWhere(['status'=>1])
          ->one();
---
SELECT * FROM `probation_videos` WHERE (`vId`='2') AND (`status`=1)

	public function actionGetvideo(){
		//获取见习视频文件数据
		$request = \Yii::$app->request;
		$username=$request->post('username');
		$type=$request->post('type');
		$result=(new Query())
		       ->select('*')
		       ->from('probation_videos')
		       ->andWhere(['username'=>$username])
		       ->andWhere(['type'=>$type])
		       ->andWhere(['status'=>1])
		       ->all();
---
SELECT * FROM `probation_videos` WHERE (`username`='chengqi') AND (`type`=1) AND (`status`=1)