trainback/backend/module/probation/controllers/InfomationController.php

SELECT * FROM `probation_files` WHERE (`username`='chengqi') AND (`type`=1) AND (`status`=1)
---
	public function actionGetfile(){
		//获取见习文件数据
		$request = \Yii::$app->request;
		$username=$request->post('username');
		$type=$request->post('type');
		$result=(new Query())
		       ->select('*')
		       ->from('probation_files')
		       ->andWhere(['username'=>$username])
		       ->andWhere(['type'=>$type])
		       ->andWhere(['status'=>1])
		       ->all();