trainback/backend/module/record/controllers/RecordController.php

SELECT * FROM `record_files` WHERE (`username`='chengqi') AND (`type`=1) AND (`status`=1)
---
   public function actionGetrecorddata(){
     $request = \Yii::$app->request;
     $username=$request->post('username');
     $type=$request->post('type');
     $query=(new Query())
           ->select('*')
           ->from('record_files')
           ->andWhere(['username'=>$username])
           ->andWhere(['type'=>$type])
           ->andWhere(['status'=>1])
           ->all();