trainback/backend/module/record/controllers/TemplateController.php

SELECT * FROM `probation_record2` WHERE 1
SELECT MAX(id) FROM `probation_record2`
INSERT INTO `probation_record2` (`id`, `username`, `type`, `date`, `weekday`, `section`, `classname`, `instructor`, `theme`, `classform`, `content1`, `content2`, `submitTime`, `status`) VALUES (1, 'chengqi', '学校见习', '2020-10-14', '星期一', '2', '初一3班', '田柾国', 'Photoshop', '新授课', '生地会考撒谎的', '大范德萨发', '2020-11-16 19:53:25', 1)
---
	public function actionSubmitrecord1(){
		$request = \Yii::$app->request;
		$username=$request ->post('username');
		$type=$request ->post('type');
		$date=$request ->post('date');
		$weekday=$request ->post('weekday');
		$section=$request ->post('section');
		$className=$request ->post('className');
		$instructor=$request ->post('instructor');
		$theme=$request ->post('theme');
		$classform=$request ->post('classform');
		$content1=$request ->post('content1');
		$content2=$request ->post('content2');
		$submitTime=$request ->post('submitTime');
		//检测是否重复提交
		$query=(new Query())
		      ->select('*')
		      ->from('probation_record2')
		      ->andWhere(['username'=>$username])
		      ->andWhere(['weekday'=>$weekday])
		      ->andWhere(['section'=>$section])
		      ->one();
		if($query==null){
		$currentId=(new Query())
    			  ->select('*')
    			  ->from('probation_record2')
                  ->max('id');
        $id=$currentId+1;
        $result=\Yii::$app->db->createCommand()->insert('probation_record2',
        	[
        	'id'=>$id,
        	'username'=>$username,
        	'type'=>$type,
        	'date'=>$date,
        	'weekday'=>$weekday,
        	'section'=>$section,
        	'classname'=>$className,
        	'instructor'=>$instructor,
        	'theme'=>$theme,
        	'classform'=>$classform,
        	'content1'=>$content1,
        	'content2'=>$content2,
        	'submitTime'=>$submitTime,
        	'status'=>1
        	])->execute();

SELECT * FROM `probation_record3` WHERE 1
SELECT MAX(id) FROM `probation_record3`
INSERT INTO `probation_record3` (`id`, `username`, `schoolname`, `className`, `date`, `content1`, `content2`, `submitTime`, `status`) VALUES (1, 'chengqi', '华师一附中', '初二4班', '2020-10-07', '<p>程度上穿戴式穿戴</p>', '<p> 程序的说法vdvfsdv</p>', '2020-11-17 09:26:56', 1)
---
    public function actionSubmitrecord2(){
    	$request = \Yii::$app->request;
    	$username=$request ->post('username');
    	$school_name=$request ->post('school_name');
    	$className=$request ->post('className');
    	$date=$request ->post('date');
    	$content1=$request ->post('content1');
    	$content2=$request ->post('content2');
    	$submitTime=$request ->post('submitTime');
    	//检测是否重复提交
    	$query=(new Query())
    	      ->select('*')
    	      ->from('probation_record3')
    	      ->andWhere(['username'=>$username])
    	      ->andWhere(['date'=>$date])
    	      ->andWhere(['className'=>$className])
    	      ->one();
    	if($query==null){
    		//插入新内容
    		$currentId=(new Query())
    			  ->select('*')
    			  ->from('probation_record3')
                  ->max('id');
            $id=$currentId+1;
            $result=\Yii::$app->db->createCommand()->insert('probation_record3',
            	[
            	'id'=>$id,
            	'username'=>$username,
            	'schoolname'=>$school_name,
            	'className'=>$className,
            	'date'=>$date,
            	'content1'=>$content1,
            	'content2'=>$content2,
            	'submitTime'=>$submitTime,
            	'status'=>1
            	])->execute();