trainback/backend/module/template/controllers/MouldController.php

SELECT * FROM `teacher_files` WHERE (`type`=1) AND (`username`='jackson')
---
	public function actionGetmyrecords(){
		//获取教师自己提交的记录
		$request = \Yii::$app->request;
        $username=$request->post('username');
        $type=$request->post('type');
        $data=(new Query())
             ->select('*')
             ->from('teacher_files')
             ->andWhere(['type'=>$type])
             ->andWhere(['username'=>$username])
             ->all();