trainback/backend/module/template/controllers/MouldController.php

	public function actionGetteatemplate(){
		//获取校内教师用的模板数据
		      $request = \Yii::$app->request;
          $type=$request->post('type');
          $status=$request->post('status');
          $query=(new Query())
                ->select('*')
                ->from('templates')
                ->andWhere(['type'=>$type])
                ->andWhere(['status'=>$status])
                ->all();
---
SELECT * FROM `templates` WHERE (`type`=1) AND (`status`=2)

    public function actionGetmylistens(){
    //获取学生实习听课记录
        $request = \Yii::$app->request;
        $username=$request->post('username');
        $type=$request->post('type');
        $kind=$request->post('kind');
        $status=$request->post('status');
        $data=(new Query())
             ->select('*')
             ->from('student_files')
             ->andWhere(['type'=>$type])
             ->andWhere(['username'=>$username])
             ->andWhere(['status'=>$status])
             ->andWhere(['kind'=>$kind])
             ->all();
---
SELECT * FROM `student_files` WHERE (`type`=2) AND (`username`='chengqi') AND (`status`=1) AND (`kind`=1)

  public function actionUploadstudata(){
    //学生上传实习记录文件
    $request = \Yii::$app->request;
    $username=$request->post('username');
    $kind=$request->post('kind');
    $type=$request->post('type');
    $status=$request->post('status');
    $menu=str_replace('\\','/',Yii::$app->basePath);
    $submitTime=date('YmdHis');
    $filename = $_FILES['file']['name'];
    $tmp_name = $_FILES['file']['tmp_name'];
    $path=$menu.'/practice/'.$filename;
    move_uploaded_file($tmp_name,$path);
    //将数据存入到数据库
    $query=(new Query())
          ->select('*')
          ->from('student_files')
          ->andWhere(['username'=>$username])
          ->andWhere(['filename'=>$filename])
          ->andWhere(['type'=>$type])
          ->andWhere(['kind'=>$kind])
          ->one();
  if($query==null){
      //插入
     $id=(new Query())
           ->select('*')
           ->from('student_files')
           ->max('rId');
      $currId=$id+1;
      $result=\Yii::$app->db->createCommand()->insert('student_files',
      [
      'rId'=>$currId,
      'type'=>$type,
      'kind'=>$kind,
      'username'=>$username,
      'filename'=>$filename,
      'path'=>$path,
      'submitTime'=>$submitTime,
      'status'=>$status
      ])->execute();
---
SELECT * FROM `student_files` WHERE (`username`='chengqi') AND (`filename`='初一（4）班第一次家长会记录.docx') AND (`type`='2') AND (`kind`='8')
SELECT MAX(rId) FROM `student_files`
INSERT INTO `student_files` (`rId`, `type`, `kind`, `username`, `filename`, `path`, `submitTime`, `status`) VALUES (10, NULL, NULL, NULL, '值日问题教育记录.doc', 'D:/xampp/htdocs/PracticeTraining/trainback/backend/practice/值日问题教育记录.doc', '20210519195609', NULL)