trainback/backend/module/template/controllers/TemplateController.php

SELECT * FROM `templates` WHERE (`publisher`='root') AND (`type`=2) AND (`status`=1)
---
  public function actionStutemplate(){
    //获取实习部分学生用模板
        $request = \Yii::$app->request;
        $username=$request->post('username');
        $data=(new Query())
             ->select('*')
             ->from('templates')
             ->andWhere(['publisher'=>$username])
             ->andWhere(['type'=>2])
             ->andWhere(['status'=>1])
             ->all();