trainback/backend/module/home/controllers/IndexController.php

SELECT * FROM `users` WHERE (`username`='root') AND (`status`=1)
UPDATE `users` SET `token`='Hl6yw7hPDrRKFdzEZOz4UnEHlg55Q1xs' WHERE id='1'
---
    public function actionLogin()
    {
    	$request = \Yii::$app->request;
    	$username = $request->post('username');
    	$password = $request->post('password');
        $query = (new Query())
            ->select('*')
            ->from('users')
            ->Where(['username'=> $username])
            ->andWhere(['status'=> 1])
            ->one();
    	if($query != null)
    	{
    	    $sqlPassword = $this->PasswordDecry($query['password']);
    	    if($sqlPassword===$password)
            {
                $token = $this->generateAccessToken();
                $id = $query['id'];
                $updateU = \Yii::$app->db->createCommand()->update('users', ['token' => $token], 'id=:id',[':id'=>$id])->execute();

SELECT * FROM `users` WHERE (`username`='chengqi') AND (`status`=1)
UPDATE `users` SET `token`='' WHERE id='3'
---
    public function actionLogout()
    {
        //改变token
        $request = \Yii::$app->request;
        $username = $request->post('username');
        $query = (new Query())
            ->select('*')
            ->from('users')
            ->Where(['username'=> $username])
            ->andWhere(['status'=> 1])
            ->one();
        if($query !=null)
        {
            $token ="";
            $id = $query['id'];
            $updateU = \Yii::$app->db->createCommand()->update('users', ['token' => $token], 'id=:id',[':id'=>$id])->execute();