trainback/backend/module/resource/controllers/DocumentionController.php

	public function actionBasicinfo(){
		//获取自己指导学生的基本信息
		$request = \Yii::$app->request;
        $username=$request->post('username');
        $query=(new Query())
              ->select('*')
              ->from('teacher_info')
              ->andWhere(['username'=>$username])
              ->andWhere(['status'=>1])
              ->one();
        if($query){
        	$job_num=$query['job_num'];
        	$member=(new Query())
        	       ->select('*')
        	       ->from('arrange_info')
        	       ->andWhere(['job_num'=>$job_num])
        	       ->andWhere(['ischecked'=>1])
        	       ->andWhere(['status'=>1])
        	       ->all();
          $data=[];//定义一个空数组
       for($i=0;$i<count($member);$i++){
       	$uname=$member[$i]['username'];//学生的用户名
       	//文档的数据
       	$document=(new Query())
       	         ->select('*')
       	         ->from('probation_files')
       	         ->andWhere(['username'=>$uname])
       	         ->andWhere(['type'=>1])
       	         ->andWhere(['status'=>1] OR ['status'=>2])
       	         ->all();
       $filenum=count($document);
       //视频的数据
       $video=(new Query())
             ->select('*')
             ->from('probation_videos')
             ->andWhere(['username'=>$uname])
             ->andWhere(['type'=>1])
             ->andWhere(['status'=>1])
             ->all();
---
SELECT * FROM `teacher_info` WHERE (`username`='shiyu') AND (`status`=1)
SELECT * FROM `arrange_info` WHERE (`job_num`='2019113042') AND (`ischecked`=1) AND (`status`=1)
SELECT * FROM `probation_files` WHERE (`username`='chengqi') AND (`type`=1) AND (1)
SELECT * FROM `probation_videos` WHERE (`username`='chengqi') AND (`type`=1) AND (`status`=1)

	public function actionTeafileurl(){
		$request = \Yii::$app->request;
        $id=$request->post('id');
        $url=(new Query())
            ->select('*')
            ->from('teacher_files')
            ->andWhere(['rId'=>$id])
            ->one();
---
SELECT * FROM `teacher_files` WHERE `rId` IS NULL