trainback/backend/module/resource/controllers/ResourceController.php

	public function actionAllteafile(){
		$request = \Yii::$app->request;
		$currentpage=$request ->post('page');
		$pageSize=8;
		$query=(new Query())
		      ->select('*')
		      ->from('teacher_info')
		      ->andWhere(['status'=>1])
		      ->all();
		$query1=(new Query())
		      ->select('*')
		      ->from('teacher_info')
		      ->andWhere(['status'=>1]);
		 $querycount=clone $query1;
		 $totalCount=$querycount->count();
		 $data=$query1->offset($pageSize*($currentpage-1))->limit($pageSize)->all();
         $pageNum = ceil($totalCount/8);
		if($query){
			$data=[];
			for($i=0;$i<count($query);$i++){
			$username=$query[$i]['username'];
		    $record=(new Query())
		           ->select('*')
		           ->from('teacher_files')
		           ->andWhere(['username'=>$username])
		           ->andWhere(['type'=>1])
		           ->andWhere(['status'=>1])
		           ->all();
---
SELECT * FROM `teacher_info` WHERE `status`=1
SELECT COUNT(*) FROM `teacher_info` WHERE `status`=1
SELECT * FROM `teacher_info` WHERE `status`=1 LIMIT 8
SELECT * FROM `teacher_files` WHERE (`username`='shiyu') AND (`type`=1) AND (`status`=1)

	public function actionRecorddetail(){
		$request = \Yii::$app->request;
        $username=$request->post('username');
        $query=(new Query())
             ->select('*')
             ->from('teacher_files')
             ->andWhere(['username'=>$username])
             ->andWhere(['type'=>1])
             ->andWhere(['status'=>1] OR ['status'=>2])
             ->all();
---
SELECT * FROM `teacher_files` WHERE (`username`='shiyu') AND (`type`=1) AND (1)