trainback/backend/module/evaluation/controllers/EvaluationController.php

	public function actionStubaseinfo(){
		    $request = \Yii::$app->request;
        $username=$request->post('username');
        //先去找系统中已经录入的信息
        $query=(new Query())
              ->select('*')
              ->from('arrange_info')
              ->andWhere(['username'=>$username])
              ->andWhere(['ischecked'=>1])
              ->andWhere(['type'=>1])
              ->andWhere(['status'=>1])
              ->one();
        //再去找评定信息
        $result=(new Query())
              ->select('*')
              ->from('student_info')
              ->andWhere(['username'=>$username])
              ->andWhere(['status'=>1])
              ->one();
        $major=$result['majorName'];
        $query1=(new Query())
               ->select('*')
               ->from('probation_assess')
               ->andWhere(['username'=>$username])
               ->andWhere(['<>','status', 0])
               ->one();
---
SELECT * FROM `arrange_info` WHERE (`username`='chengqi') AND (`ischecked`=1) AND (`type`=1) AND (`status`=1)
SELECT * FROM `student_info` WHERE (`username`='chengqi') AND (`status`=1)
SELECT * FROM `probation_assess` WHERE (`username`='chengqi') AND (`status` <> 0)

	public function actionAssessinfo(){
		$request = \Yii::$app->request;
        $username=$request->post('username');
        $query=(new Query())
              ->select('*')
              ->from('probation_assess')
              ->andWhere(['username'=>$username])
              ->andWhere(['<>','status', 0])
              ->one();
---
SELECT * FROM `probation_assess` WHERE (`username`='chengqi') AND (`status` <> 0)

	public function actionMymember(){
		//获取自己的组员
		    $request = \Yii::$app->request;
        $school=$request->post('school');
        $tName=$request->post('tName');
        $query=(new Query())
               ->select('*')
               ->from('arrange_info')
               ->andWhere(['tName'=>$tName])
               ->andWhere(['school_name'=>$school])
               ->andWhere(['ischecked'=>1])
               ->andWhere(['type'=>1])
               ->andWhere(['status'=>1])
               ->all();
        if($query){
        	$member=[];
        	for($i=0;$i<count($query);$i++){
        		$member[$i]['username']=$query[$i]['username'];
        		$status=(new Query())
        		       ->select('*')
        		       ->from('probation_assess')
        		       ->andWhere(['username'=>$member[$i]['username']])
        		       ->one();
---
SELECT * FROM `arrange_info` WHERE (`tName`='施雨') AND (`school_name`='华中师范大学第一附属中学') AND (`ischecked`=1) AND (`type`=1) AND (`status`=1)
SELECT * FROM `probation_assess` WHERE `username`='chengqi'

   public function actionStudentdata(){
       	//校内导师获取见习生的基本情况
    $request = \Yii::$app->request;
    $username=$request->post('username');
    //去查找校内教师的基本信息
    $query=(new Query())
          ->select('*')
          ->from('teacher_info')
          ->andWhere(['username'=>$username])
          ->andWhere(['status'=>1])
          ->one();
    if($query){
        //去查找带领学生的信息
        $jno=$query['job_num'];
    	$member=(new Query())
    	       ->select('*')
    	       ->from('arrange_info')
    	       ->andWhere(['job_num'=>$jno])
    	       ->andWhere(['ischecked'=>1])
    	       ->andWhere(['type'=>1])
    	       ->andWhere(['status'=>1])
    	       ->all();
---
SELECT * FROM `teacher_info` WHERE (`username`='shiyu') AND (`status`=1)
SELECT * FROM `arrange_info` WHERE (`job_num`='2019113042') AND (`ischecked`=1) AND (`type`=1) AND (`status`=1)

        	$data[$i]['tName']=$member[$i]['tName'];//校内教师
        	$data[$i]['tutorName']=$member[$i]['tutor_name'];//校外教师
        	//获取评价信息
        	$assess=(new Query())
        	       ->select('*')
        	       ->from('probation_assess')
        	       ->andWhere(['username'=>$data[$i]['uname']])
        	       ->one();
---
SELECT * FROM `probation_assess` WHERE `username`='chengqi'