trainback/backend/module/evaluation/controllers/MarkController.php

	public function actionStudentmark(){
		//校内导师获取见习生的基本情况
	   $request = \Yii::$app->request;
       $username=$request->post('username');
	   //去查教师的工号
	   $query=(new Query())
	         ->select('*')
	         ->from('teacher_info')
	         ->andWhere(['username'=>$username])
	         ->andWhere(['status'=>1])
             ->one();
       if($query){
       	$jno=$query['job_num'];
       	$member=(new Query())
       	       ->select('*')
       	       ->from('arrange_info')
       	       ->andWhere(['job_num'=>$jno])
       	       ->andWhere(['ischecked'=>1])
    	       ->andWhere(['type'=>1])
    	       ->andWhere(['status'=>1])
    	       ->all();
---
SELECT * FROM `teacher_info` WHERE (`username`='shiyu') AND (`status`=1)
SELECT * FROM `arrange_info` WHERE (`job_num`='2019113042') AND (`ischecked`=1) AND (`type`=1) AND (`status`=1)

        	$data[$i]['school']=$member[$i]['school_name'];//校外教师
        	$data[$i]['grade']=$member[$i]['grade'];//校外教师
           //获取分数
           	$mark=(new Query())
        	       ->select('*')
        	       ->from('probation_assess')
        	       ->andWhere(['username'=>$data[$i]['uname']])
        	       ->one();
---
SELECT * FROM `probation_assess` WHERE `username`='chengqi'

	public function actionMarkdetail(){
	   $request = \Yii::$app->request;
       $username=$request->post('uname');
       //先总后细节
       $data=[];
       $query=(new Query())
             ->select('*')
             ->from('probation_assess')
             ->andWhere(['username'=>$username])
             ->one();
        $query1=(new Query())
             ->select('*')
             ->from('probation_mark')
             ->andWhere(['uname'=>$username])
             ->andWhere(['status'=>1])
             ->one();
---
SELECT * FROM `probation_assess` WHERE `username`='chengqi'
SELECT * FROM `probation_mark` WHERE (`uname`='chengqi') AND (`status`=1)

	public function actionMarkdata(){
	  	$query=(new Query())
   	      ->select('*')
   	      ->from('probation_assess')
   	      ->andWhere(['<>','status',0])
   	      ->all();
---
SELECT * FROM `probation_assess` WHERE `status` <> 0